import json, time, datetime
from plugins.utils import *

class main:
    level = 1
    keywords = ['расп']
    def execute(self, msg):
        config = json.loads(open('data/rasp.json','r').read())
        zam_data = msg['user_text'].split(' ')
        if zam_data[0]=='сет' and msg['userid'] == 354255965:
            day = zam_data[1]
            text = ' '.join(zam_data[2:])
            config['zam'][int(day)-1] = text
            open('data/rasp.json','w').write(json.dumps(config))
            apisay('Заметка добавлена',msg['toho'])
            return 0
        if zam_data[0]=='дел' and msg['userid'] == 354255965:
            day = zam_data[1]
            config['zam'][int(day)-1] = False
            open('data/rasp.json','w').write(json.dumps(config))
            apisay('Заметка удалена',msg['toho'])
            return 0
        mode = config['mode']
        date_now = datetime.datetime.now().strftime('%A|%d').split('|')
        if config['day'] != date_now[1] and date_now[0] == 'Воскресенье':
            if mode==0: 
                mode=1
            else:
                mode=0
            config['mode'] = mode
            config['day'] = date_now[1]
            open('data/rasp.json','w').write(json.dumps(config))
            apisay('[LOG] Тип недели изменен на '+str(mode),msg['toho']) 

        if mode==0:
            mode_text = 'Числитель'
        else:
            mode_text = 'Знаменатель'     

        rasp = [
                    [
                        [
                            ['МДК 01.01 МИКРОСХЕМОТЕХНИКА', 611], 
                            ['МДК 01.01 МИКРОСХЕМОТЕХНИКА', 611], 
                            ['МДК 01.01 ИСТОЧНИКИ ПИТАНИЯ', 505]
                        ], 
                        [
                            ['ФИЗИЧЕСКАЯ КУЛЬТУРА', 'С/З'], 
                            ['ОСНОВЫ ФИЛОСОФИИ', 616], 
                            ['МДК 01.02 КОНСТРУИРОВАНИЕ, ПРОИЗВОДСТВО, ЭКСПЛУАТАЦИЯ СВТ', 718], 
                            ['ИНОСТРАННЫЙ ЯЗЫК', 714]
                        ], 
                        [
                            [False], 
                            ['МДК 02.01 АРХИТЕКТУРА ЭВМ', 712], 
                            ['ОСНОВЫ ФИЛОСОФИИ', 616], 
                            ['ИНОСТРАННЫЙ ЯЗЫК', 515]
                        ], 
                        [
                            ['МДК 01.02 КОНСТРУИРОВАНИЕ, ПРОИЗВОДСТВО, ЭКСПЛУАТАЦИЯ СВТ', 718], 
                            ['МДК 01.01 ИСТОЧНИКИ ПИТАНИЯ', 505]
                        ], 
                        [
                            ['МДК 03.02 СИСТЕМЫ УПРАВЛЕНИЯ БАЗАМИ ДАННЫХ', 308], 
                            ['МДК 03.02 СИСТЕМЫ УПРАВЛЕНИЯ БАЗАМИ ДАННЫХ', 308], 
                            ['МДК 02.01 ПРОГРАММИРОВАНИЕ МИКРОКОНТРОЛЛЕРОВ', 521], 
                            ['МДК 01.01 МИКРОСХЕМОТЕХНИКА', 521]
                        ], 
                        [
                            ['МДК 02.01 АРХИТЕКТУРА ЭВМ', 712], 
                            ['МДК 01.02 КОНСТРУИРОВАНИЕ, ПРОИЗВОДСТВО, ЭКСПЛУАТАЦИЯ СВТ', 718], 
                            ['МДК 03.02 СИСТЕМЫ УПРАВЛЕНИЯ БАЗАМИ ДАННЫХ', 308]
                        ]
                    ], 
                    [
                        [
                            ['МДК 01.01 МИКРОСХЕМОТЕХНИКА', 611], 
                            ['МДК 01.01 МИКРОСХЕМОТЕХНИКА', 611], 
                            ['МДК 01.01 ИСТОЧНИКИ ПИТАНИЯ', 505]
                        ], 
                        [
                            ['ФИЗИЧЕСКАЯ КУЛЬТУРА', 'С/З'], 
                            ['ОСНОВЫ ФИЛОСОФИИ', 616], 
                            ['МДК 01.02 КОНСТРУИРОВАНИЕ, ПРОИЗВОДСТВО, ЭКСПЛУАТАЦИЯ СВТ', 718], 
                            ['ИНОСТРАННЫЙ ЯЗЫК', 714]
                        ],
                        [
                            [False], 
                            ['МДК 02.01 АРХИТЕКТУРА ЭВМ', 712], 
                            ['МДК 01.02 КОНСТРУИРОВАНИЕ, ПРОИЗВОДСТВО, ЭКСПЛУАТАЦИЯ СВТ', 718], 
                            ['ИНОСТРАННЫЙ ЯЗЫК', 515]
                        ], 
                        [
                            ['МДК 01.02 КОНСТРУИРОВАНИЕ, ПРОИЗВОДСТВО, ЭКСПЛУАТАЦИЯ СВТ', 718], 
                            ['МДК 01.01 ИСТОЧНИКИ ПИТАНИЯ', 505], 
                            ['МДК 02.01 АРХИТЕКТУРА ЭВМ', 712]
                        ], 
                        [
                            [False], 
                            ['МДК 03.02 СИСТЕМЫ УПРАВЛЕНИЯ БАЗАМИ ДАННЫХ', 308], 
                            ['МДК 02.01 ПРОГРАММИРОВАНИЕ МИКРОКОНТРОЛЛЕРОВ', 521], 
                            ['МДК 01.01 МИКРОСХЕМОТЕХНИКА', 521]
                        ], 
                        [
                            ['МДК 02.01 АРХИТЕКТУРА ЭВМ', 712], 
                            ['МДК 01.02 КОНСТРУИРОВАНИЕ, ПРОИЗВОДСТВО, ЭКСПЛУАТАЦИЯ СВТ', 718], 
                            ['МДК 03.02 СИСТЕМЫ УПРАВЛЕНИЯ БАЗАМИ ДАННЫХ', 308]
                        ]
                    ]
                ]
        day_names_ru = ['Понедельник','Вторник','Среда','Четверг','Пятница','Суббота']

        if len(msg['user_text'])==0:
            today=int(datetime.datetime.now().strftime('%w'))-1
            if today==-1:
                apisay('Сегодня выходной :(',msg['toho'])
                return 0
        else:
            today = int(msg['user_text'].split(' ')[0])-1
        out = '[ {0} ]\n\n{1}:\n'.format(mode_text,day_names_ru[today])
        key=1
        for value in rasp[mode][today]:

            if value[0] != False:
                out += '{0}) {1} ({2})\n'.format(key,value[0],value[1])
            else:
                out += '{0}) Пары нет\n'.format(key)
            key += 1

        if config['zam'][today] != False:
            out += '\nЗаметка на этот день:\n'+config['zam'][today]
        
        apisay(out,msg['toho'])
        